## 1. Создать ~~SFrame~~ DataFrame на основе файла с тестовыми данными people-example.csv
 Загрузим файл people-example.csv и поместим его в папку /Assignment_2_data. Забудем про GraphLab и не будем тратить время на его сборку, когда можем использовать pandas, который работает из коробки.
 #### Соберём pandas, если он ещё не установлен

In [9]:
! pip install pandas

Requirement already satisfied: pandas in c:\python27\lib\site-packages
Requirement already satisfied: numpy>=1.9.0 in c:\python27\lib\site-packages (from pandas)
Requirement already satisfied: python-dateutil in c:\python27\lib\site-packages (from pandas)
Requirement already satisfied: pytz>=2011k in c:\python27\lib\site-packages (from pandas)
Requirement already satisfied: six>=1.5 in c:\python27\lib\site-packages (from python-dateutil->pandas)

#### Загрузим people-example.csv с помощью pandas и отобразим первые 10 строк содержимого

In [29]:
import pandas
df = pandas.read_csv('Assignment_2_data/people-example.csv')
df.head(10)

         Имя    Фамилия      Город   Страна  Возраст
0      Семен    Мельник     Чикаго      США       24
1      Елена      Бойко     Квебек   Канада       23
2  Екатерина  Коваленко  Манчестер   Англия       45
3  Александр     Шевчук  Вашингтон      США       23
4       Иван    Олейник       Киев  Украина       23
5      София  Коваленко       Киев  Украина       22
6    Николай    Семенов  Стокгольм   Швеция       25
7      Елена      Бойко     Квебек   Канада       23
8  Екатерина  Коваленко  Манчестер   Англия       22
9  Александр     Шевчук  Вашингтон      США       23

## 2. Используя функцию numpy.random.randint() создать новый столбец “Номер дома” с псевдо-случайными значениями в диапазоне [1, 150).
Для этого сначала импортируем numPy и сгенерируем массив из количества элементов равным количеству строк в **df** в заданном диапазоне, а затем добавим его как столбец и отобразим первые 5 строк результата.

In [30]:
import numpy as np
rowCount = df.shape[0]
houseNumbers = np.random.randint(1, 150, rowCount)
df['Номер дома'] = houseNumbers
df.head(5)

         Имя    Фамилия      Город   Страна  Возраст  Номер дома
0      Семен    Мельник     Чикаго      США       24         135
1      Елена      Бойко     Квебек   Канада       23          25
2  Екатерина  Коваленко  Манчестер   Англия       45          43
3  Александр     Шевчук  Вашингтон      США       23          70
4       Иван    Олейник       Киев  Украина       23          84

## 3. Создать новый столбец “ФИО”, который объединял бы значения столбцов “Имя” и “Фамилия”.
 Пройдёмся по строкам **df** и создадим новый массив состоящий из соединенных имён и фамилий. Добавим созданный массив к **df** как новый столбец ФИО. Отобразим первые 5 строк.

In [31]:
fullNames = []
for index, row in df.iterrows():
   fullNames.append(('{0} {1}'.format(row['Фамилия'], row['Имя'])))
df['ФИО'] = fullNames
df.head(5)

,Имя,Фамилия,Город,Страна,Возраст,Номер дома,ФИО
0,Семен,Мельник,Чикаго,США,24,135,Мельник Семен
1,Елена,Бойко,Квебек,Канада,23,25,Бойко Елена
2,Екатерина,Коваленко,Манчестер,Англия,45,43,Коваленко Екатерина
3,Александр,Шевчук,Вашингтон,США,23,70,Шевчук Александр
4,Иван,Олейник,Киев,Украина,23,84,Олейник Иван

## 4.     Используя логический фильтр, вывести все строки, в которых:
1. 'ФИО' = 'Семенов Семен' ИЛИ 'Страна' = 'США'
2. 'Возраст' != 24

Для этого получим отфильтрованый dataFrame, использовав метод [where](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.where.html) и лямбда-выражение с логическими условиями фильтрации. В качестве логических операторов необходимо использовать & и | вместо and и or, в противном случае, мы получим исключение типа ValueError, так как pandas считает значения типа True и False двусмысленными(ambiguous). Выведем результат полностью, убрав пустые строки содержащие NaN с помощью метода dropna()

In [46]:
df_filtered = df.where(lambda x: ((x['Страна'] == 'США') | (x['ФИО'] == 'Семенов Семен')) & (x['Возраст'] != 24)).dropna()
df_filtered

,Имя,Фамилия,Город,Страна,Возраст,Номер дома,ФИО
3,Александр,Шевчук,Вашингтон,США,23.0,70.0,Шевчук Александр
9,Александр,Шевчук,Вашингтон,США,23.0,104.0,Шевчук Александр
12,Семен,Семенов,Стокгольм,Швеция,25.0,32.0,Семенов Семен
15,Александр,Шевчук,Вашингтон,США,23.0,126.0,Шевчук Александр
21,Александр,Шевчук,Вашингтон,США,23.0,54.0,Шевчук Александр
24,Семен,Семенов,Стокгольм,Швеция,25.0,145.0,Семенов Семен
27,Александр,Шевчук,Чикаго,США,23.0,10.0,Шевчук Александр
33,Александр,Шевчук,Чикаго,США,23.0,78.0,Шевчук Александр
36,Семен,Семенов,Стокгольм,Швеция,25.0,82.0,Семенов Семен
39,Александр,Шевчук,Вашингтон,США,23.0,148.0,Шевчук Александр
45,Александр,Шевчук,Вашингтон,США,23.0,121.0,Шевчук Александр
48,Семен,Семенов,Стокгольм,Швеция,25.0,10.0,Семенов Семен
51,Александр,Шевчук,Вашингтон,США,23.0,35.0,Шевчук Александр
54,Семен,Семенов,Стокгольм,Швеция,25.0,87.0,Семенов Семен
55,Семен,Семенов,Вашингтон,США,25.0,3.0,Семенов Семен

## 5. Вывести количество полученных записей для пункта 4.

In [47]:
print(df_filtered.shape[0])

15